{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "def replace_urls_with_prefixes(text, prefix_dict):\n",
    "    \"\"\"Replace URLs with prefixes in a given string.\n",
    "\n",
    "    Args:\n",
    "        text (str): String containing SPARQL query or text.\n",
    "        prefix_dict (dict): Mapping of prefixes to URLs.\n",
    "    \"\"\"\n",
    "    for prefix, url in prefix_dict.items():\n",
    "        text = text.replace(url, prefix)\n",
    "    return text\n",
    "\n",
    "\n",
    "def replace_prefixes_with_urls(text, prefix_dict):\n",
    "    \"\"\"Replace prefixes with URLs in a given string.\n",
    "\n",
    "    Args:\n",
    "        text (str): String containing SPARQL query or text.\n",
    "        prefix_dict (dict): Mapping of prefixes to URLs.\n",
    "    \"\"\"\n",
    "    for prefix, url in prefix_dict.items():\n",
    "        text = text.replace(prefix, url)\n",
    "    return text\n",
    "\n",
    "\n",
    "def parse_sparql_output(query_output: dict):\n",
    "    \"\"\"Parse query JSON output to dataframe.\n",
    "\n",
    "    Args:\n",
    "        query_output (dict): The output from a SPARQL query in JSON format\n",
    "\n",
    "    Returns:\n",
    "        pd.DataFrame: the parsed results as a pandas DataFrame\n",
    "    \"\"\"\n",
    "    columns = query_output['head']['vars']\n",
    "    rows = []\n",
    "    for result in query_output['results']['bindings']:\n",
    "        row = {}\n",
    "        for col in columns:\n",
    "            row[col] = result[col]['value'] if col in result else None\n",
    "        rows.append(row)\n",
    "    df = pd.DataFrame(rows, columns=columns)\n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "def replace_urls_with_prefixes(text, prefix_dict):\n",
    "    \"\"\"Replace URLs with prefixes in a given string.\n",
    "\n",
    "    Args:\n",
    "        text (str): String containing SPARQL query or text.\n",
    "        prefix_dict (dict): Mapping of prefixes to URLs.\n",
    "    \"\"\"\n",
    "    for prefix, url in prefix_dict.items():\n",
    "        text = text.replace(url, prefix)\n",
    "    return text\n",
    "\n",
    "\n",
    "def replace_prefixes_with_urls(text, prefix_dict):\n",
    "    \"\"\"Replace prefixes with URLs in a given string.\n",
    "\n",
    "    Args:\n",
    "        text (str): String containing SPARQL query or text.\n",
    "        prefix_dict (dict): Mapping of prefixes to URLs.\n",
    "    \"\"\"\n",
    "    for prefix, url in prefix_dict.items():\n",
    "        text = text.replace(prefix, url)\n",
    "    return text\n",
    "\n",
    "\n",
    "def parse_sparql_output(query_output: dict):\n",
    "    \"\"\"Parse query JSON output to dataframe.\n",
    "\n",
    "    Args:\n",
    "        query_output (dict): The output from a SPARQL query in JSON format\n",
    "\n",
    "    Returns:\n",
    "        pd.DataFrame: the parsed results as a pandas DataFrame\n",
    "    \"\"\"\n",
    "    columns = query_output['head']['vars']\n",
    "    rows = []\n",
    "    for result in query_output['results']['bindings']:\n",
    "        row = {}\n",
    "        for col in columns:\n",
    "            row[col] = result[col]['value'] if col in result else None\n",
    "        rows.append(row)\n",
    "    df = pd.DataFrame(rows, columns=columns)\n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# SPARQL\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "def execute_sparql(url: str, query: str):\n",
    "    \"\"\"    \n",
    "    Executes a SPARQL query against a specified endpoint.\n",
    "\n",
    "    This function sends a SPARQL query to the given endpoint URL and returns the results in JSON format.\n",
    "\n",
    "    Args:\n",
    "        url (str): The URL of the SPARQL query endpoint.\n",
    "        query (str): The SPARQL query to be executed.\n",
    "\n",
    "    Returns:\n",
    "        dict: The results of the SPARQL query in JSON format.\n",
    "    \"\"\"\n",
    "    wrapper = SPARQLWrapper(url)\n",
    "    wrapper.setQuery(query)\n",
    "    wrapper.setReturnFormat(JSON)\n",
    "    results = wrapper.query().convert()\n",
    "\n",
    "    return results\n",
    "\n",
    "\n",
    "def execute_parse_sparql(url, queries):\n",
    "    \"\"\"Helper function for retrieve_context().\n",
    "\n",
    "    Args:\n",
    "        url (_type_): _description_\n",
    "        queries (_type_): _description_\n",
    "\n",
    "    Returns:\n",
    "        _type_: _description_\n",
    "    \"\"\"\n",
    "    results = []\n",
    "    for index, query in enumerate(queries):\n",
    "        result = execute_sparql(url=url, query=PREFIXES+query)\n",
    "        table = parse_sparql_output(result).to_string()\n",
    "        results.append(f\"Triples: {index}\\n{table}\")\n",
    "    subgraph = \"\\n\".join(results)\n",
    "    subgraph = replace_urls_with_prefixes(subgraph, prefix_dict)\n",
    "    return subgraph\n",
    "\n",
    "\n",
    "PREFIXES = \"\"\"\n",
    "  PREFIX : <http://www.co-ode.org/ontologies/pizza#> \n",
    "  PREFIX dc: <http://purl.org/dc/elements/1.1/> \n",
    "  PREFIX owl: <http://www.w3.org/2002/07/owl#> \n",
    "  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
    "  PREFIX xml: <http://www.w3.org/XML/1998/namespace> \n",
    "  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> \n",
    "  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \n",
    "  PREFIX skos: <http://www.w3.org/2004/02/skos/core#> \n",
    "  PREFIX pizza: <http://www.co-ode.org/ontologies/pizza/pizza.owl#> \n",
    "  PREFIX terms: <http://purl.org/dc/terms/> \n",
    "  BASE <http://www.co-ode.org/ontologies/pizza#> \n",
    "\"\"\"\n",
    "\n",
    "prefix_dict = {\n",
    "    \":\": \"http://www.co-ode.org/ontologies/pizza#\",\n",
    "    \"dc:\": \"http://purl.org/dc/elements/1.1/\",\n",
    "    \"owl:\": \"http://www.w3.org/2002/07/owl#\",\n",
    "    \"rdf:\": \"http://www.w3.org/1999/02/22-rdf-syntax-ns#\",\n",
    "    \"xml:\": \"http://www.w3.org/XML/1998/namespace\",\n",
    "    \"xsd:\": \"http://www.w3.org/2001/XMLSchema#\",\n",
    "    \"rdfs:\": \"http://www.w3.org/2000/01/rdf-schema#\",\n",
    "    \"skos:\": \"http://www.w3.org/2004/02/skos/core#\",\n",
    "    \"pizza:\": \"http://www.co-ode.org/ontologies/pizza/pizza.owl#\",\n",
    "    \"terms:\": \"http://purl.org/dc/terms/\",\n",
    "    \"base:\": \"http://www.co-ode.org/ontologies/pizza#\"\n",
    "}\n",
    "\n",
    "EXTRACTION_QUERY = \"\"\"\n",
    "SELECT DISTINCT ?individual\n",
    "WHERE {{\n",
    "{{\n",
    " SELECT ?individual\n",
    " WHERE {{\n",
    "   ?individual rdfs:subClassOf* {pizza_class} .\n",
    " }}\n",
    "}}\n",
    "UNION\n",
    "{{\n",
    " SELECT DISTINCT ?individual\n",
    " WHERE {{\n",
    "   ?individual rdf:type owl:Class ;\n",
    "           owl:equivalentClass ?equivClass .\n",
    "\n",
    "   ?equivClass owl:intersectionOf ?list .\n",
    "   ?list rdf:rest*/rdf:first {pizza_class} .\n",
    " }}\n",
    "}}\n",
    "}}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# UTILS\n",
    "from strictjson import strict_json\n",
    "from openai import OpenAI\n",
    "import chromadb\n",
    "\n",
    "ER_SYSTEM_PROMPT = \"\"\"\n",
    "You are an expert in the gastronomy domain with extensive knowledge of various pizzas and toppings. Your task is to accurately identify and extract the names of machines and parts from given text. You should \n",
    "focus on recognizing specific terminology and contextually relevant phrases that pertain to pizza names and their toppings \n",
    "within the gastronomy sector. Your output should be in JSON format, categorizing the identified terms into \"pizza\" \n",
    "and \"topping\". The output should be strictly the JSON object without any additional commentary or explanation.\n",
    "\"\"\"\n",
    "\n",
    "ER_USER_PROMPT = \"\"\"\n",
    "I want you to identify the pizza and topping of the following input.\n",
    "\n",
    "Input: {input}\n",
    "Output: \n",
    "\"\"\"\n",
    "\n",
    "def strictjson_llm(system_prompt: str, user_prompt: str):\n",
    "    \"\"\"LLM function call to be passed to strictjson.strict_json().\n",
    "    Refer to https://github.com/tanchongmin/strictjson/blob/main/strictjson/base.py#L319\n",
    "\n",
    "    Args:\n",
    "        system_prompt (str): System prompt.\n",
    "        user_prompt (str): User prompt.\n",
    "\n",
    "    Returns:\n",
    "        str: LLM response string.\n",
    "    \"\"\"\n",
    "    messages = [\n",
    "        {\"role\": \"system\", \"content\": system_prompt},\n",
    "        {\"role\": \"user\", \"content\": user_prompt},\n",
    "    ]   \n",
    "\n",
    "    client = OpenAI(base_url=\"http://localhost:1234/v1\", api_key=\"lm-studio\")\n",
    "\n",
    "    response = client.chat.completions.create(\n",
    "        model=\"lmstudio-community/Meta-Llama-3-8B-Instruct-GGUF\",\n",
    "        messages=messages,\n",
    "        temperature=0.7,\n",
    "    )\n",
    "    \n",
    "    return response.choices[0].message.content\n",
    "\n",
    "def entity_recognition(input: str) -> dict:\n",
    "    \"\"\"\n",
    "    Performs entity recognition on the provided input string using a large language model (LLM).\n",
    "\n",
    "    This function identifies and categorizes entities within the user input, specifically separating them into machine and part.\n",
    "\n",
    "    Multiple \n",
    "\n",
    "    Args:\n",
    "        input (str): The input string to be analyzed by the LLM.\n",
    "\n",
    "    Returns:\n",
    "        dict: A dictionary with two keys, 'machines' and 'parts', containing the identified machine names and part names respectively.\n",
    "\n",
    "    Example:\n",
    "        Input: \"Can Creality Ender manufacture flange?\"\n",
    "        Output: {'machines': ['Creality Ender'], 'parts': ['flange']}\n",
    "\n",
    "    \"\"\"\n",
    "    response = strict_json(\n",
    "        system_prompt=ER_SYSTEM_PROMPT,\n",
    "        user_prompt=ER_USER_PROMPT.format(input=input),\n",
    "        output_format={\"pizza\": \"Array of pizza\", \n",
    "                       \"topping\": \"Array of topping\"},\n",
    "        llm=strictjson_llm\n",
    "    )\n",
    "\n",
    "    return response"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Context retrieval"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "entities = entity_recognition(\"Can an American pizza use a cheese topping?\")\n",
    "path = '../../manon_chat_interface/data/vectorstores/entities'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "client = chromadb.PersistentClient(path=path)\n",
    "if entities[\"pizza\"]:\n",
    "    collection = client.get_or_create_collection(\"pizza_collection\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'ids': [['0c3340e5-7cbf-58e5-8ca9-64b4b1893367']],\n",
       " 'distances': [[0.0]],\n",
       " 'metadatas': [[{'IRI': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#American'}]],\n",
       " 'embeddings': None,\n",
       " 'documents': [['American']],\n",
       " 'uris': None,\n",
       " 'data': None}"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "embeddings = collection.query(\n",
    "    query_texts=entities[\"pizza\"],\n",
    "    n_results=1\n",
    ")\n",
    "embeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### SPARQL"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "def parse_sparql_output(query_output: dict):\n",
    "    \"\"\"_summary_\n",
    "\n",
    "    Args:\n",
    "        query_output (dict): The output from a SPARQL query in JSON format\n",
    "\n",
    "    Returns:\n",
    "        pd.DataFrame: the parsed results as a pandas DataFrame\n",
    "    \"\"\"\n",
    "    columns = query_output['head']['vars']\n",
    "    rows = []\n",
    "    for result in query_output['results']['bindings']:\n",
    "        row = {}\n",
    "        for col in columns:\n",
    "            row[col] = result[col]['value'] if col in result else None\n",
    "        rows.append(row)\n",
    "    df = pd.DataFrame(rows, columns=columns)\n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "import re\n",
    "\n",
    "# Define the SPARQL endpoint\n",
    "sparql = SPARQLWrapper(\"http://localhost:3030/pizza/query\")\n",
    "\n",
    "# Set the query\n",
    "sparql.setQuery(query)\n",
    "\n",
    "# Set the return format to JSON\n",
    "sparql.setReturnFormat(JSON)\n",
    "\n",
    "# Execute the query and get the results\n",
    "results = sparql.query().convert()\n",
    "\n",
    "# bindings = results['results']['bindings']\n",
    "# pizza_IRIs = [binding['individual']['value'] for binding in bindings]\n",
    "# pizza_names = [re.split('#', iri)[-1] for iri in pizza_IRIs]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "URL = \"http://localhost:3030/pizza/query\"\n",
    "iri = \"pizza:Pizza\"\n",
    "\n",
    "results = execute_sparql(url=URL, query=PREFIXES+EXTRACTION_QUERY.format(pizza_class=iri))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['class', 'label']},\n",
       " 'results': {'bindings': [{'class': {'type': 'uri',\n",
       "     'value': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#Pizza'},\n",
       "    'label': {'type': 'literal', 'xml:lang': 'en', 'value': 'Pizza'}},\n",
       "   {'class': {'type': 'uri',\n",
       "     'value': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#PizzaBase'},\n",
       "    'label': {'type': 'literal', 'xml:lang': 'pt', 'value': 'BaseDaPizza'}},\n",
       "   {'class': {'type': 'uri',\n",
       "     'value': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#PizzaBase'},\n",
       "    'label': {'type': 'literal', 'xml:lang': 'en', 'value': 'PizzaBase'}},\n",
       "   {'class': {'type': 'uri',\n",
       "     'value': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#Food'},\n",
       "    'label': {'type': 'literal', 'xml:lang': 'en', 'value': 'Food'}},\n",
       "   {'class': {'type': 'uri',\n",
       "     'value': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#Spiciness'},\n",
       "    'label': {'type': 'literal', 'xml:lang': 'en', 'value': 'Spiciness'}},\n",
       "   {'class': {'type': 'uri',\n",
       "     'value': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#Spiciness'},\n",
       "    'label': {'type': 'literal', 'xml:lang': 'pt', 'value': 'Tempero'}},\n",
       "   {'class': {'type': 'uri',\n",
       "     'value': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#PizzaTopping'},\n",
       "    'label': {'type': 'literal',\n",
       "     'xml:lang': 'pt',\n",
       "     'value': 'CoberturaDaPizza'}},\n",
       "   {'class': {'type': 'uri',\n",
       "     'value': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#PizzaTopping'},\n",
       "    'label': {'type': 'literal', 'xml:lang': 'en', 'value': 'PizzaTopping'}},\n",
       "   {'class': {'type': 'uri',\n",
       "     'value': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#American'},\n",
       "    'label': {'type': 'literal', 'xml:lang': 'en', 'value': 'American'}},\n",
       "   {'class': {'type': 'uri',\n",
       "     'value': 'http://www.co-ode.org/ontologies/pizza/pizza.owl#American'},\n",
       "    'label': {'type': 'literal', 'xml:lang': 'pt', 'value': 'Americana'}}]}}"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = parse_sparql_output(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "prefix_dict = {\n",
    "    \":\": \"http://www.co-ode.org/ontologies/pizza#\",\n",
    "    \"dc:\": \"http://purl.org/dc/elements/1.1/\",\n",
    "    \"owl:\": \"http://www.w3.org/2002/07/owl#\",\n",
    "    \"rdf:\": \"http://www.w3.org/1999/02/22-rdf-syntax-ns#\",\n",
    "    \"xml:\": \"http://www.w3.org/XML/1998/namespace\",\n",
    "    \"xsd:\": \"http://www.w3.org/2001/XMLSchema#\",\n",
    "    \"rdfs:\": \"http://www.w3.org/2000/01/rdf-schema#\",\n",
    "    \"skos:\": \"http://www.w3.org/2004/02/skos/core#\",\n",
    "    \"pizza:\": \"http://www.co-ode.org/ontologies/pizza/pizza.owl#\",\n",
    "    \"terms:\": \"http://purl.org/dc/terms/\",\n",
    "    \"base:\": \"http://www.co-ode.org/ontologies/pizza#\"\n",
    "}\n",
    "\n",
    "def replace_urls_with_prefixes(text, prefix_dict):\n",
    "    \"\"\"Replace URLs with prefixes in a given string.\n",
    "\n",
    "    Args:\n",
    "        query (str): String containing SPARQL query or text.\n",
    "        prefix_dict (dict): Mapping of prefixes to URLs.\n",
    "    \"\"\"\n",
    "    for prefix, url in prefix_dict.items():\n",
    "        query = query.replace(url, prefix)\n",
    "    return query\n",
    "\n",
    "\n",
    "def replace_prefixes_with_urls(query, prefix_dict):\n",
    "    \"\"\"Replace prefixes with URLs in a given string.\n",
    "\n",
    "    Args:\n",
    "        query (str): String containing SPARQL query or text.\n",
    "        prefix_dict (dict): Mapping of prefixes to URLs.\n",
    "    \"\"\"\n",
    "    for prefix, url in prefix_dict.items():\n",
    "        query = query.replace(prefix, url)\n",
    "    return query"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Generate n-hop"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "PREFIXES = \"\"\"\n",
    "PREFIX : <http://www.co-ode.org/ontologies/pizza#> \n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/> \n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#> \n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace> \n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> \n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#> \n",
    "PREFIX pizza: <http://www.co-ode.org/ontologies/pizza/pizza.owl#> \n",
    "PREFIX terms: <http://purl.org/dc/terms/> \n",
    "BASE <http://www.co-ode.org/ontologies/pizza#> \n",
    "\"\"\"\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "ONE_HOP = \"\"\"\n",
    "SELECT ?subject ?predicate ?object WHERE {{\n",
    "  {{\n",
    "    ?s ?p {IRI} .\n",
    "    BIND(?s AS ?subject)\n",
    "    BIND(?p AS ?predicate)\n",
    "    BIND({IRI} AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "  UNION\n",
    "  {{\n",
    "    {IRI} ?p ?o .\n",
    "    BIND({IRI} AS ?subject)\n",
    "    BIND(?p AS ?predicate)\n",
    "    BIND(?o AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "}}\n",
    "\"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "TWO_HOP = \"\"\"\n",
    "SELECT ?subject ?predicate ?object WHERE {{\n",
    "  {{\n",
    "    ?s ?p {IRI} .\n",
    "    BIND(?s AS ?subject)\n",
    "    BIND(?p AS ?predicate)\n",
    "    BIND({IRI} AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "  UNION\n",
    "  {{\n",
    "    ?s ?p {IRI} .\n",
    "    ?s1 ?p1 ?s .\n",
    "    BIND(?s1 AS ?subject)\n",
    "    BIND(?p1 AS ?predicate)\n",
    "    BIND(?s AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "  UNION\n",
    "  {{\n",
    "    {IRI} ?p ?o .\n",
    "    BIND({IRI} AS ?subject)\n",
    "    BIND(?p AS ?predicate)\n",
    "    BIND(?o AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "  UNION\n",
    "  {{\n",
    "    {IRI} ?p ?o .\n",
    "    ?o ?p1 ?o1 .\n",
    "    BIND(?o AS ?subject)\n",
    "    BIND(?p1 AS ?predicate)\n",
    "    BIND(?o1 AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "}}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "THREE_HOP = \"\"\"\n",
    "SELECT ?subject ?predicate ?object WHERE {{\n",
    "  {{\n",
    "    ?s ?p {IRI} .\n",
    "    BIND(?s AS ?subject)\n",
    "    BIND(?p AS ?predicate)\n",
    "    BIND({IRI} AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "  UNION\n",
    "  {{\n",
    "    ?s ?p {IRI} .\n",
    "    ?s1 ?p1 ?s .\n",
    "    BIND(?s1 AS ?subject)\n",
    "    BIND(?p1 AS ?predicate)\n",
    "    BIND(?s AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "  UNION\n",
    "  {{\n",
    "    ?s ?p {IRI} .\n",
    "    ?s1 ?p1 ?s .\n",
    "    ?s2 ?p2 ?s1 .\n",
    "    BIND(?s2 AS ?subject)\n",
    "    BIND(?p2 AS ?predicate)\n",
    "    BIND(?s1 AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "  UNION\n",
    "  {{\n",
    "    {IRI} ?p ?o .\n",
    "    BIND({IRI} AS ?subject)\n",
    "    BIND(?p AS ?predicate)\n",
    "    BIND(?o AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "  UNION\n",
    "  {{\n",
    "    {IRI} ?p ?o .\n",
    "    ?o ?p1 ?o1 .\n",
    "    BIND(?o AS ?subject)\n",
    "    BIND(?p1 AS ?predicate)\n",
    "    BIND(?o1 AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "  UNION\n",
    "  {{\n",
    "    {IRI} ?p ?o .\n",
    "    ?o ?p1 ?o1 .\n",
    "    ?o1 ?p2 ?o2 .\n",
    "    BIND(?o1 AS ?subject)\n",
    "    BIND(?p2 AS ?predicate)\n",
    "    BIND(?o2 AS ?object)\n",
    "    FILTER (!isBlank(?subject) && !isBlank(?object))\n",
    "  }}\n",
    "}}\n",
    "\"\"\"\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Test generated SPARQL executability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = {'sparql_query': \"\\nPREFIX pizza: <http://www.co-ode.org/ontologies/pizza#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\n\\nSELECT ?p\\nWHERE {\\n  ?p a pizza:Pizza.\\n  ?p a pizza:AmercianPizza.\\n  OPTIONAL { ?p pizza:hasTopping ?t. }\\n  FILTER ( regex(?t, 'Mozzarella', 'i') )\\n}\\n\", 'explanation': 'This SPARQL query first selects pizzas that are of type American Pizza and then optionally includes the toppings of these pizzas. It filters for Mozzarella topping in a case-insensitive manner.'}\n",
    "\n",
    "sparql_query = result['sparql_query']\n",
    "explanation = result['explanation']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "PREFIX pizza: <http://www.co-ode.org/ontologies/pizza#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "\n",
      "SELECT ?p\n",
      "WHERE {\n",
      "  ?p a pizza:Pizza.\n",
      "  ?p a pizza:AmercianPizza.\n",
      "  OPTIONAL { ?p pizza:hasTopping ?t. }\n",
      "  FILTER ( regex(?t, 'Mozzarella', 'i') )\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "print(sparql_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = execute_parse_sparql(url=\"http://localhost:3030/pizza/query\", queries=[sparql_query])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Triples: 0\\nEmpty DataFrame\\nColumns: [p, o]\\nIndex: []'"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv-sparql",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
